base/redis_bench_result_2/get_128_6387.log
2023-11-24 14:58:45
====== GET ======
  4000032 requests completed in 20.90 seconds
  32 parallel clients
  128 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.00% <= 0.2 milliseconds
0.06% <= 0.3 milliseconds
4.68% <= 0.4 milliseconds
12.06% <= 0.5 milliseconds
36.26% <= 0.6 milliseconds
66.05% <= 0.7 milliseconds
77.05% <= 0.8 milliseconds
83.20% <= 0.9 milliseconds
89.70% <= 1.0 milliseconds
95.34% <= 1.1 milliseconds
99.23% <= 1.2 milliseconds
99.65% <= 1.3 milliseconds
99.75% <= 1.4 milliseconds
99.83% <= 1.5 milliseconds
99.88% <= 1.6 milliseconds
99.91% <= 1.7 milliseconds
99.92% <= 1.8 milliseconds
99.92% <= 1.9 milliseconds
99.92% <= 2 milliseconds
99.95% <= 3 milliseconds
99.96% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
191416.58 requests per second