base/redis_bench_result_2/get_32_6452.log
2023-11-24 14:52:02
====== GET ======
  20000032 requests completed in 99.04 seconds
  32 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.00% <= 0.2 milliseconds
0.07% <= 0.3 milliseconds
0.89% <= 0.4 milliseconds
4.93% <= 0.5 milliseconds
40.22% <= 0.6 milliseconds
73.53% <= 0.7 milliseconds
85.78% <= 0.8 milliseconds
91.89% <= 0.9 milliseconds
95.75% <= 1.0 milliseconds
98.36% <= 1.1 milliseconds
99.43% <= 1.2 milliseconds
99.67% <= 1.3 milliseconds
99.74% <= 1.4 milliseconds
99.80% <= 1.5 milliseconds
99.85% <= 1.6 milliseconds
99.88% <= 1.7 milliseconds
99.89% <= 1.8 milliseconds
99.90% <= 1.9 milliseconds
99.91% <= 2 milliseconds
99.94% <= 3 milliseconds
99.95% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
201932.81 requests per second