base/redis_bench_result_2/get_32_6497.log
2023-11-24 14:52:02
====== GET ======
  20000000 requests completed in 93.56 seconds
  32 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.00% <= 0.2 milliseconds
0.00% <= 0.3 milliseconds
0.03% <= 0.4 milliseconds
4.96% <= 0.5 milliseconds
59.10% <= 0.6 milliseconds
91.35% <= 0.7 milliseconds
95.04% <= 0.8 milliseconds
96.87% <= 0.9 milliseconds
98.28% <= 1.0 milliseconds
99.04% <= 1.1 milliseconds
99.45% <= 1.2 milliseconds
99.59% <= 1.3 milliseconds
99.68% <= 1.4 milliseconds
99.75% <= 1.5 milliseconds
99.80% <= 1.6 milliseconds
99.83% <= 1.7 milliseconds
99.85% <= 1.8 milliseconds
99.86% <= 1.9 milliseconds
99.86% <= 2 milliseconds
99.91% <= 3 milliseconds
99.94% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
213773.42 requests per second