base/redis_bench_result_2/get_64_6405.log
2023-11-24 14:56:02
====== GET ======
  20000056 requests completed in 101.46 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.00% <= 0.2 milliseconds
0.29% <= 0.3 milliseconds
2.99% <= 0.4 milliseconds
13.10% <= 0.5 milliseconds
41.78% <= 0.6 milliseconds
67.52% <= 0.7 milliseconds
82.09% <= 0.8 milliseconds
91.26% <= 0.9 milliseconds
95.92% <= 1.0 milliseconds
98.04% <= 1.1 milliseconds
99.17% <= 1.2 milliseconds
99.68% <= 1.3 milliseconds
99.79% <= 1.4 milliseconds
99.86% <= 1.5 milliseconds
99.91% <= 1.6 milliseconds
99.94% <= 1.7 milliseconds
99.95% <= 1.8 milliseconds
99.96% <= 1.9 milliseconds
99.97% <= 2 milliseconds
99.99% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
197132.28 requests per second