base/redis_bench_result_2/set_256_6460.log
2023-11-24 14:59:26
====== SET ======
  4000032 requests completed in 19.96 seconds
  32 parallel clients
  256 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.2 milliseconds
0.05% <= 0.3 milliseconds
0.97% <= 0.4 milliseconds
15.79% <= 0.5 milliseconds
47.13% <= 0.6 milliseconds
70.23% <= 0.7 milliseconds
80.20% <= 0.8 milliseconds
88.38% <= 0.9 milliseconds
95.96% <= 1.0 milliseconds
98.48% <= 1.1 milliseconds
99.08% <= 1.2 milliseconds
99.21% <= 1.3 milliseconds
99.30% <= 1.4 milliseconds
99.41% <= 1.5 milliseconds
99.48% <= 1.6 milliseconds
99.54% <= 1.7 milliseconds
99.60% <= 1.8 milliseconds
99.63% <= 1.9 milliseconds
99.65% <= 2 milliseconds
99.87% <= 3 milliseconds
99.95% <= 4 milliseconds
99.96% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
200372.30 requests per second