base/redis_bench_result_2/set_32_6452.log
2023-11-24 14:50:06
====== SET ======
  20000088 requests completed in 93.22 seconds
  32 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.2 milliseconds
0.02% <= 0.3 milliseconds
0.33% <= 0.4 milliseconds
8.60% <= 0.5 milliseconds
58.52% <= 0.6 milliseconds
89.62% <= 0.7 milliseconds
93.22% <= 0.8 milliseconds
96.01% <= 0.9 milliseconds
98.06% <= 1.0 milliseconds
98.89% <= 1.1 milliseconds
99.15% <= 1.2 milliseconds
99.32% <= 1.3 milliseconds
99.43% <= 1.4 milliseconds
99.51% <= 1.5 milliseconds
99.58% <= 1.6 milliseconds
99.62% <= 1.7 milliseconds
99.65% <= 1.8 milliseconds
99.68% <= 1.9 milliseconds
99.70% <= 2 milliseconds
99.90% <= 3 milliseconds
99.96% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
214537.97 requests per second